weifengdq/embedded/tc397/tc397_uart_lettershell/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC39xB/IfxGtm_PinMap_TC39xB_516.c
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT136_P22_10_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_k, 136, {&MODULE_P22,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT141_P32_6_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_j, 141, {&MODULE_P32, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT160_P01_9_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 160, {&MODULE_P01, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT180_P31_6_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 180, {&MODULE_P31, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT212_P25_6_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 212, {&MODULE_P25, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT212_P26_0_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 212, {&MODULE_P26, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT247_P15_15_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 247, {&MODULE_P15,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT249_P13_12_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_i, 249, {&MODULE_P13,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_6_TOUT270_P10_15_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 270, {&MODULE_P10,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7N_TOUT121_P11_4_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_i, 121, {&MODULE_P11, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7N_TOUT152_P02_15_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_k, 152, {&MODULE_P02,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7N_TOUT157_P01_15_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_i, 157, {&MODULE_P01,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7N_TOUT176_P31_2_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_k, 176, {&MODULE_P31, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7N_TOUT208_P25_2_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_k, 208, {&MODULE_P25, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7_TOUT126_P11_14_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 126, {&MODULE_P11,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7_TOUT137_P22_11_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_k, 137, {&MODULE_P22,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7_TOUT142_P32_7_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_j, 142, {&MODULE_P32, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7_TOUT161_P01_13_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 161, {&MODULE_P01,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7_TOUT181_P31_7_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 181, {&MODULE_P31, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7_TOUT213_P25_7_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 213, {&MODULE_P25, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM5_7_TOUT248_P13_9_OUT = {IfxGtm_Atom_5, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 248, {&MODULE_P13, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0N_TOUT161_P01_13_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_j, 161, {&MODULE_P01,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0N_TOUT189_P31_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_j, 189, {&MODULE_P31,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0N_TOUT221_P25_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_j, 221, {&MODULE_P25,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0N_TOUT264_P13_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_k, 264, {&MODULE_P13,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0_TOUT127_P11_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 127, {&MODULE_P11,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0_TOUT141_P32_6_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 141, {&MODULE_P32, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0_TOUT155_P01_0_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_d, 155, {&MODULE_P01, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0_TOUT162_P01_8_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_j, 162, {&MODULE_P01, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0_TOUT182_P31_8_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 182, {&MODULE_P31, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0_TOUT214_P25_8_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 214, {&MODULE_P25, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0_TOUT242_P15_10_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_i, 242, {&MODULE_P15,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_0_TOUT250_P13_11_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 250, {&MODULE_P13,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1N_TOUT158_P01_12_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_j, 158, {&MODULE_P01,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1N_TOUT186_P31_12_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_j, 186, {&MODULE_P31,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1N_TOUT218_P25_12_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_j, 218, {&MODULE_P25,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1N_TOUT254_P13_5_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_k, 254, {&MODULE_P13, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1N_TOUT261_P14_12_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_k, 261, {&MODULE_P14,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1_TOUT128_P12_0_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 128, {&MODULE_P12, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1_TOUT142_P32_7_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 142, {&MODULE_P32, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1_TOUT156_P01_2_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_d, 156, {&MODULE_P01, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1_TOUT164_P01_14_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_j, 164, {&MODULE_P01,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1_TOUT183_P31_9_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 183, {&MODULE_P31, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1_TOUT215_P25_9_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 215, {&MODULE_P25, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1_TOUT251_P13_10_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 251, {&MODULE_P13,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_1_TOUT258_P14_11_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 258, {&MODULE_P14,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2N_TOUT159_P01_1_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_j, 159, {&MODULE_P01, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2N_TOUT187_P31_13_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_j, 187, {&MODULE_P31,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2N_TOUT219_P25_13_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_j, 219, {&MODULE_P25,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2N_TOUT255_P13_6_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_k, 255, {&MODULE_P13, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2_TOUT129_P12_1_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 129, {&MODULE_P12, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2_TOUT143_P33_14_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 143, {&MODULE_P33,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2_TOUT152_P02_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_j, 152, {&MODULE_P02,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2_TOUT157_P01_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_d, 157, {&MODULE_P01,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2_TOUT184_P31_10_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 184, {&MODULE_P31,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2_TOUT216_P25_10_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 216, {&MODULE_P25,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2_TOUT252_P13_14_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 252, {&MODULE_P13,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_2_TOUT259_P14_14_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 259, {&MODULE_P14,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3N_TOUT160_P01_9_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_j, 160, {&MODULE_P01, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3N_TOUT188_P31_14_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_j, 188, {&MODULE_P31,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3N_TOUT220_P25_14_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_j, 220, {&MODULE_P25,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3N_TOUT256_P13_7_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_k, 256, {&MODULE_P13, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3N_TOUT263_P14_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_k, 263, {&MODULE_P14,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3_TOUT111_P01_3_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_j, 111, {&MODULE_P01, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3_TOUT144_P33_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 144, {&MODULE_P33,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3_TOUT163_P01_10_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_j, 163, {&MODULE_P01,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3_TOUT165_P01_11_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_d, 165, {&MODULE_P01,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3_TOUT185_P31_11_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 185, {&MODULE_P31,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3_TOUT217_P25_11_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 217, {&MODULE_P25,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3_TOUT253_P13_4_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 253, {&MODULE_P13, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_3_TOUT260_P14_13_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 260, {&MODULE_P14,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4N_TOUT163_P01_10_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_l, 163, {&MODULE_P01,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4N_TOUT165_P01_11_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_j, 165, {&MODULE_P01,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4N_TOUT185_P31_11_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_j, 185, {&MODULE_P31,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4N_TOUT217_P25_11_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_j, 217, {&MODULE_P25,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4N_TOUT253_P13_4_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_k, 253, {&MODULE_P13, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4N_TOUT260_P14_13_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_k, 260, {&MODULE_P14,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4_TOUT140_P32_5_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_i, 140, {&MODULE_P32, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4_TOUT143_P33_14_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_d, 143, {&MODULE_P33,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4_TOUT158_P01_12_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_d, 158, {&MODULE_P01,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4_TOUT186_P31_12_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 186, {&MODULE_P31,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4_TOUT218_P25_12_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 218, {&MODULE_P25,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4_TOUT254_P13_5_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 254, {&MODULE_P13, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4_TOUT261_P14_12_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 261, {&MODULE_P14,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_4_TOUT31_P33_9_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_i, 31, {&MODULE_P33, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5N_TOUT155_P01_0_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_j, 155, {&MODULE_P01, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5N_TOUT162_P01_8_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_l, 162, {&MODULE_P01, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5N_TOUT182_P31_8_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_j, 182, {&MODULE_P31, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5N_TOUT214_P25_8_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_j, 214, {&MODULE_P25, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5N_TOUT250_P13_11_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_j, 250, {&MODULE_P13,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5_TOUT146_P34_1_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 146, {&MODULE_P34, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5_TOUT159_P01_1_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_d, 159, {&MODULE_P01, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5_TOUT187_P31_13_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 187, {&MODULE_P31,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5_TOUT219_P25_13_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 219, {&MODULE_P25,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5_TOUT243_P15_11_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_i, 243, {&MODULE_P15,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5_TOUT255_P13_6_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 255, {&MODULE_P13, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_5_TOUT262_P13_13_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_5, IfxGtm_ToutSel_c, 262, {&MODULE_P13,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_6N_TOUT156_P01_2_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_j, 156, {&MODULE_P01, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_6N_TOUT158_P01_12_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_l, 158, {&MODULE_P01,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_6N_TOUT183_P31_9_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_j, 183, {&MODULE_P31, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_6N_TOUT215_P25_9_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_j, 215, {&MODULE_P25, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_6N_TOUT251_P13_10_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_k, 251, {&MODULE_P13,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_6N_TOUT258_P14_11_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_k, 258, {&MODULE_P14,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_6_TOUT147_P34_2_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 147, {&MODULE_P34, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_6_TOUT160_P01_9_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_d, 160, {&MODULE_P01, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_6_TOUT188_P31_14_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 188, {&MODULE_P31,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_6_TOUT220_P25_14_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 220, {&MODULE_P25,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_6_TOUT256_P13_7_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 256, {&MODULE_P13, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_6_TOUT263_P14_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_6, IfxGtm_ToutSel_c, 263, {&MODULE_P14,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_7N_TOUT152_P02_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_l, 152, {&MODULE_P02,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_7N_TOUT157_P01_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_j, 157, {&MODULE_P01,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_7N_TOUT184_P31_10_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_j, 184, {&MODULE_P31,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_7N_TOUT216_P25_10_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_j, 216, {&MODULE_P25,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_7N_TOUT252_P13_14_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_k, 252, {&MODULE_P13,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_7N_TOUT259_P14_14_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_k, 259, {&MODULE_P14,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_7_TOUT148_P34_3_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 148, {&MODULE_P34, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_7_TOUT161_P01_13_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_d, 161, {&MODULE_P01,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_7_TOUT189_P31_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 189, {&MODULE_P31,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_7_TOUT221_P25_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 221, {&MODULE_P25,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_7_TOUT244_P15_12_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_i, 244, {&MODULE_P15,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM6_7_TOUT264_P13_15_OUT = {IfxGtm_Atom_6, IfxGtm_Atom_Ch_7, IfxGtm_ToutSel_c, 264, {&MODULE_P13,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_0_TOUT149_P34_4_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 149, {&MODULE_P34, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_0_TOUT162_P01_8_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 162, {&MODULE_P01, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_0_TOUT190_P30_0_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 190, {&MODULE_P30, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_0_TOUT222_P24_0_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_c, 222, {&MODULE_P24, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_0_TOUT249_P13_12_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_d, 249, {&MODULE_P13,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_0_TOUT258_P14_11_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_0, IfxGtm_ToutSel_j, 258, {&MODULE_P14,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_1_TOUT150_P34_5_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 150, {&MODULE_P34, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_1_TOUT163_P01_10_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 163, {&MODULE_P01,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_1_TOUT191_P30_1_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 191, {&MODULE_P30, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_1_TOUT223_P24_1_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_c, 223, {&MODULE_P24, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_1_TOUT242_P15_10_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_d, 242, {&MODULE_P15,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_1_TOUT245_P15_13_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_j, 245, {&MODULE_P15,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_1_TOUT253_P13_4_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_j, 253, {&MODULE_P13, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_1_TOUT265_P10_9_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_1, IfxGtm_ToutSel_d, 265, {&MODULE_P10, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_2_TOUT164_P01_14_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 164, {&MODULE_P01,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_2_TOUT192_P30_2_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 192, {&MODULE_P30, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_2_TOUT224_P24_2_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_c, 224, {&MODULE_P24, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_2_TOUT243_P15_11_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_d, 243, {&MODULE_P15,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_2_TOUT246_P15_14_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_j, 246, {&MODULE_P15,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_2_TOUT254_P13_5_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_j, 254, {&MODULE_P13, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_2_TOUT266_P10_10_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_2, IfxGtm_ToutSel_d, 266, {&MODULE_P10,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_3_TOUT166_P00_14_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 166, {&MODULE_P00,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_3_TOUT193_P30_3_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 193, {&MODULE_P30, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_3_TOUT225_P24_3_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_c, 225, {&MODULE_P24, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_3_TOUT244_P15_12_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_d, 244, {&MODULE_P15,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_3_TOUT247_P15_15_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_j, 247, {&MODULE_P15,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_3_TOUT255_P13_6_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_j, 255, {&MODULE_P13, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_3_TOUT267_P10_14_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_3, IfxGtm_ToutSel_d, 267, {&MODULE_P10,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_4_TOUT167_P00_13_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 167, {&MODULE_P00,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_4_TOUT194_P30_4_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 194, {&MODULE_P30, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_4_TOUT226_P24_4_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_c, 226, {&MODULE_P24, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Atom_ToutMap IfxGtm_ATOM7_4_TOUT245_P15_13_OUT = {IfxGtm_Atom_7, IfxGtm_Atom_Ch_4, IfxGtm_ToutSel_d, 245, {&MODULE_P15,13}, IfxPort_OutputIdx_alt1};
