weifengdq/embedded/tc397/tc397_uart_lettershell/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC39xB/IfxGtm_PinMap_TC39xB_516.c
IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P30_15_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_7, {&MODULE_P30,15}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P31_15_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_7, {&MODULE_P31,15}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P32_7_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_7, {&MODULE_P32, 7}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P34_5_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_7, {&MODULE_P34, 5}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P01_12_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_0, {&MODULE_P01,12}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P10_9_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_0, {&MODULE_P10, 9}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P13_4_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_0, {&MODULE_P13, 4}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P20_6_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_0, {&MODULE_P20, 6}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P23_7_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_0, {&MODULE_P23, 7}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P24_0_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_0, {&MODULE_P24, 0}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P25_0_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_0, {&MODULE_P25, 0}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P30_8_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_0, {&MODULE_P30, 8}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM6_0_P31_8_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_0, {&MODULE_P31, 8}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P01_13_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_1, {&MODULE_P01,13}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P10_10_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_1, {&MODULE_P10,10}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P13_5_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_1, {&MODULE_P13, 5}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P20_7_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_1, {&MODULE_P20, 7}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P23_6_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_1, {&MODULE_P23, 6}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P24_1_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_1, {&MODULE_P24, 1}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P25_1_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_1, {&MODULE_P25, 1}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P30_9_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_1, {&MODULE_P30, 9}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM6_1_P31_9_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_1, {&MODULE_P31, 9}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P01_14_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_2, {&MODULE_P01,14}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P10_11_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_2, {&MODULE_P10,11}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P13_6_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_2, {&MODULE_P13, 6}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P20_8_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_2, {&MODULE_P20, 8}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P23_5_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_2, {&MODULE_P23, 5}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P24_2_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_2, {&MODULE_P24, 2}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P25_2_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_2, {&MODULE_P25, 2}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P30_10_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_2, {&MODULE_P30,10}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM6_2_P31_10_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_2, {&MODULE_P31,10}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P01_15_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_3, {&MODULE_P01,15}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P10_13_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_3, {&MODULE_P10,13}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P13_7_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_3, {&MODULE_P13, 7}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P20_9_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_3, {&MODULE_P20, 9}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P23_4_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_3, {&MODULE_P23, 4}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P24_3_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_3, {&MODULE_P24, 3}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P25_3_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_3, {&MODULE_P25, 3}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P30_11_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_3, {&MODULE_P30,11}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM6_3_P31_11_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_3, {&MODULE_P31,11}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM6_4_P00_4_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_4, {&MODULE_P00, 4}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM6_4_P13_9_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_4, {&MODULE_P13, 9}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM6_4_P14_12_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_4, {&MODULE_P14,12}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM6_4_P23_3_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_4, {&MODULE_P23, 3}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM6_4_P24_4_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_4, {&MODULE_P24, 4}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM6_4_P25_4_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_4, {&MODULE_P25, 4}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM6_4_P30_12_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_4, {&MODULE_P30,12}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM6_4_P31_12_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_4, {&MODULE_P31,12}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM6_5_P00_13_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_5, {&MODULE_P00,13}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM6_5_P13_10_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_5, {&MODULE_P13,10}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM6_5_P14_13_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_5, {&MODULE_P14,13}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM6_5_P23_2_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_5, {&MODULE_P23, 2}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM6_5_P24_5_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_5, {&MODULE_P24, 5}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM6_5_P25_5_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_5, {&MODULE_P25, 5}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM6_5_P30_13_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_5, {&MODULE_P30,13}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM6_5_P31_13_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_5, {&MODULE_P31,13}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P00_14_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_6, {&MODULE_P00,14}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P13_11_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_6, {&MODULE_P13,11}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P14_14_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_6, {&MODULE_P14,14}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P23_1_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_6, {&MODULE_P23, 1}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P24_6_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_6, {&MODULE_P24, 6}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P25_6_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_6, {&MODULE_P25, 6}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P26_0_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_6, {&MODULE_P26, 0}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P30_14_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_6, {&MODULE_P30,14}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM6_6_P31_14_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_6, {&MODULE_P31,14}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM6_7_P00_15_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_7, {&MODULE_P00,15}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM6_7_P13_12_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_7, {&MODULE_P13,12}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM6_7_P14_15_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_7, {&MODULE_P14,15}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM6_7_P23_0_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_7, {&MODULE_P23, 0}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM6_7_P24_7_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_7, {&MODULE_P24, 7}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM6_7_P25_7_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_7, {&MODULE_P25, 7}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM6_7_P30_15_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_7, {&MODULE_P30,15}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM6_7_P31_15_IN = {IfxGtm_Tim_6, IfxGtm_Tim_Ch_7, {&MODULE_P31,15}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM7_0_P10_14_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_0, {&MODULE_P10,14}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM7_0_P13_13_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_0, {&MODULE_P13,13}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM7_0_P15_10_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_0, {&MODULE_P15,10}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM7_0_P22_3_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_0, {&MODULE_P22, 3}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM7_0_P24_8_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_0, {&MODULE_P24, 8}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM7_0_P25_8_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_0, {&MODULE_P25, 8}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM7_0_P30_0_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_0, {&MODULE_P30, 0}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM7_0_P31_0_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_0, {&MODULE_P31, 0}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM7_1_P10_15_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_1, {&MODULE_P10,15}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM7_1_P13_14_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_1, {&MODULE_P13,14}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM7_1_P15_11_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_1, {&MODULE_P15,11}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM7_1_P22_2_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_1, {&MODULE_P22, 2}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM7_1_P24_9_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_1, {&MODULE_P24, 9}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM7_1_P25_9_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_1, {&MODULE_P25, 9}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM7_1_P30_1_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_1, {&MODULE_P30, 1}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM7_1_P31_1_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_1, {&MODULE_P31, 1}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM7_2_P13_15_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_2, {&MODULE_P13,15}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM7_2_P15_12_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_2, {&MODULE_P15,12}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM7_2_P22_1_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_2, {&MODULE_P22, 1}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM7_2_P24_10_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_2, {&MODULE_P24,10}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM7_2_P25_10_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_2, {&MODULE_P25,10}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM7_2_P30_2_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_2, {&MODULE_P30, 2}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM7_2_P31_2_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_2, {&MODULE_P31, 2}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM7_3_P12_0_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_3, {&MODULE_P12, 0}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM7_3_P15_13_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_3, {&MODULE_P15,13}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM7_3_P22_0_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_3, {&MODULE_P22, 0}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM7_3_P24_11_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_3, {&MODULE_P24,11}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM7_3_P25_11_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_3, {&MODULE_P25,11}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM7_3_P30_3_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_3, {&MODULE_P30, 3}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM7_3_P31_3_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_3, {&MODULE_P31, 3}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM7_4_P12_1_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_4, {&MODULE_P12, 1}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM7_4_P15_14_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_4, {&MODULE_P15,14}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM7_4_P24_12_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_4, {&MODULE_P24,12}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM7_4_P25_12_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_4, {&MODULE_P25,12}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM7_4_P30_4_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_4, {&MODULE_P30, 4}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM7_4_P31_4_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_4, {&MODULE_P31, 4}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM7_5_P11_0_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_5, {&MODULE_P11, 0}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM7_5_P15_15_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_5, {&MODULE_P15,15}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM7_5_P24_13_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_5, {&MODULE_P24,13}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM7_5_P25_13_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_5, {&MODULE_P25,13}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM7_5_P30_5_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_5, {&MODULE_P30, 5}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM7_5_P31_5_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_5, {&MODULE_P31, 5}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM7_6_P11_1_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_6, {&MODULE_P11, 1}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM7_6_P14_11_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_6, {&MODULE_P14,11}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM7_6_P24_14_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_6, {&MODULE_P24,14}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM7_6_P25_14_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_6, {&MODULE_P25,14}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM7_6_P30_6_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_6, {&MODULE_P30, 6}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM7_6_P31_6_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_6, {&MODULE_P31, 6}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM7_7_P11_4_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_7, {&MODULE_P11, 4}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM7_7_P24_14_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_7, {&MODULE_P24,14}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM7_7_P24_15_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_7, {&MODULE_P24,15}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM7_7_P30_7_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_7, {&MODULE_P30, 7}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM7_7_P31_7_IN = {IfxGtm_Tim_7, IfxGtm_Tim_Ch_7, {&MODULE_P31, 7}, (IfxGtm_ChXSel)5};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT106_P10_4_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 106, {&MODULE_P10, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT17_P00_8_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 17, {&MODULE_P00, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT25_P33_3_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 25, {&MODULE_P33, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT34_P33_12_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 34, {&MODULE_P33,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT51_P21_0_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_f, 51, {&MODULE_P21, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT61_P20_3_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_f, 61, {&MODULE_P20, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT72_P15_1_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 72, {&MODULE_P15, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT7_P02_7_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 7, {&MODULE_P02, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT91_P13_0_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 91, {&MODULE_P13, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0N_TOUT9_P00_0_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 9, {&MODULE_P00, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT0_P02_0_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 0, {&MODULE_P02, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT109_P10_7_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_a, 109, {&MODULE_P10, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT151_P02_12_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_g, 151, {&MODULE_P02,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT18_P00_9_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_a, 18, {&MODULE_P00, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT26_P33_4_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_a, 26, {&MODULE_P33, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT32_P33_10_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_a, 32, {&MODULE_P33,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT53_P21_2_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_a, 53, {&MODULE_P21, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT76_P15_5_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_a, 76, {&MODULE_P15, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT77_P15_6_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_a, 77, {&MODULE_P15, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT85_P14_5_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_a, 85, {&MODULE_P14, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_0_TOUT87_P14_7_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_a, 87, {&MODULE_P14, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_10_TOUT12_P00_3_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_10, IfxGtm_ToutSel_a, 12, {&MODULE_P00, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_10_TOUT2_P02_2_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_10, IfxGtm_ToutSel_a, 2, {&MODULE_P02, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_10_TOUT41_P23_0_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_10, IfxGtm_ToutSel_a, 41, {&MODULE_P23, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_10_TOUT46_P23_5_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_10, IfxGtm_ToutSel_a, 46, {&MODULE_P23, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_10_TOUT96_P11_3_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_10, IfxGtm_ToutSel_a, 96, {&MODULE_P11, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_11_TOUT13_P00_4_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_a, 13, {&MODULE_P00, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_11_TOUT3_P02_3_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_a, 3, {&MODULE_P02, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_11_TOUT43_P23_2_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_a, 43, {&MODULE_P23, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_11_TOUT49_P22_2_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_a, 49, {&MODULE_P22, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_11_TOUT97_P11_6_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_a, 97, {&MODULE_P11, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_12_TOUT14_P00_5_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_a, 14, {&MODULE_P00, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_12_TOUT44_P23_3_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_a, 44, {&MODULE_P23, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_12_TOUT4_P02_4_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_a, 4, {&MODULE_P02, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_12_TOUT50_P22_3_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_a, 50, {&MODULE_P22, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_12_TOUT98_P11_9_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_a, 98, {&MODULE_P11, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_13_TOUT15_P00_6_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_a, 15, {&MODULE_P00, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_13_TOUT5_P02_5_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_a, 5, {&MODULE_P02, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_13_TOUT99_P11_10_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_a, 99, {&MODULE_P11,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_14_TOUT100_P11_11_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_a, 100, {&MODULE_P11,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_14_TOUT16_P00_7_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_a, 16, {&MODULE_P00, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_14_TOUT6_P02_6_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_a, 6, {&MODULE_P02, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_15_TOUT101_P11_12_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_15, IfxGtm_ToutSel_a, 101, {&MODULE_P11,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_15_TOUT17_P00_8_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_15, IfxGtm_ToutSel_a, 17, {&MODULE_P00, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_15_TOUT42_P23_1_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_15, IfxGtm_ToutSel_b, 42, {&MODULE_P23, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_15_TOUT7_P02_7_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_15, IfxGtm_ToutSel_a, 7, {&MODULE_P02, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT107_P10_5_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_e, 107, {&MODULE_P10, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT10_P00_1_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_e, 10, {&MODULE_P00, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT14_P00_5_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_e, 14, {&MODULE_P00, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT22_P33_0_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_e, 22, {&MODULE_P33, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT30_P33_8_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_e, 30, {&MODULE_P33, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT35_P33_13_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_e, 35, {&MODULE_P33,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT39_P32_3_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_g, 39, {&MODULE_P32, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT4_P02_4_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_e, 4, {&MODULE_P02, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT52_P21_1_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_f, 52, {&MODULE_P21, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT57_P21_6_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_e, 57, {&MODULE_P21, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT73_P15_2_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_e, 73, {&MODULE_P15, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT90_P14_10_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_e, 90, {&MODULE_P14,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1N_TOUT92_P13_1_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_e, 92, {&MODULE_P13, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1_TOUT103_P10_1_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_a, 103, {&MODULE_P10, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1_TOUT116_P02_9_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_g, 116, {&MODULE_P02, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1_TOUT19_P00_10_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_a, 19, {&MODULE_P00,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1_TOUT1_P02_1_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_e, 1, {&MODULE_P02, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1_TOUT27_P33_5_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_a, 27, {&MODULE_P33, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM0_1_TOUT31_P33_9_OUT = {IfxGtm_Tom_0, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_a, 31, {&MODULE_P33, 9}, IfxPort_OutputIdx_alt1};
