weifengdq/embedded/tc397/tc397_uart_lettershell/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC39xB/IfxGtm_PinMap_TC39xB_516.c
IfxGtm_Tom_ToutMap IfxGtm_TOM4_3N_TOUT256_P13_7_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_f, 256, {&MODULE_P13, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_3_TOUT165_P01_11_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_b, 165, {&MODULE_P01,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_3_TOUT193_P30_3_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_a, 193, {&MODULE_P30, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_3_TOUT225_P24_3_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_a, 225, {&MODULE_P24, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_3_TOUT253_P13_4_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_b, 253, {&MODULE_P13, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4N_TOUT112_P01_4_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_e, 112, {&MODULE_P01, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4N_TOUT151_P02_12_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_e, 151, {&MODULE_P02,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4N_TOUT165_P01_11_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_f, 165, {&MODULE_P01,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4N_TOUT193_P30_3_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_e, 193, {&MODULE_P30, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4N_TOUT225_P24_3_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_e, 225, {&MODULE_P24, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4N_TOUT253_P13_4_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_f, 253, {&MODULE_P13, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4_TOUT111_P01_3_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_e, 111, {&MODULE_P01, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4_TOUT158_P01_12_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_b, 158, {&MODULE_P01,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4_TOUT194_P30_4_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_a, 194, {&MODULE_P30, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4_TOUT226_P24_4_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_a, 226, {&MODULE_P24, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4_TOUT254_P13_5_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_b, 254, {&MODULE_P13, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_4_TOUT8_P02_8_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_e, 8, {&MODULE_P02, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_5N_TOUT113_P01_5_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_e, 113, {&MODULE_P01, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_5N_TOUT153_P02_13_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_e, 153, {&MODULE_P02,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_5N_TOUT155_P01_0_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_f, 155, {&MODULE_P01, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_5N_TOUT190_P30_0_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_e, 190, {&MODULE_P30, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_5N_TOUT222_P24_0_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_e, 222, {&MODULE_P24, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_5N_TOUT250_P13_11_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_f, 250, {&MODULE_P13,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_5_TOUT116_P02_9_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_b, 116, {&MODULE_P02, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_5_TOUT159_P01_1_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_b, 159, {&MODULE_P01, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_5_TOUT195_P30_5_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_a, 195, {&MODULE_P30, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_5_TOUT227_P24_5_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_a, 227, {&MODULE_P24, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_5_TOUT255_P13_6_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_b, 255, {&MODULE_P13, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_6N_TOUT114_P01_6_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_e, 114, {&MODULE_P01, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_6N_TOUT154_P02_14_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_e, 154, {&MODULE_P02,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_6N_TOUT156_P01_2_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_f, 156, {&MODULE_P01, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_6N_TOUT191_P30_1_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_e, 191, {&MODULE_P30, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_6N_TOUT223_P24_1_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_e, 223, {&MODULE_P24, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_6N_TOUT251_P13_10_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_f, 251, {&MODULE_P13,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_6_TOUT117_P02_10_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_b, 117, {&MODULE_P02,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_6_TOUT160_P01_9_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_b, 160, {&MODULE_P01, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_6_TOUT196_P30_6_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_a, 196, {&MODULE_P30, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_6_TOUT228_P24_6_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_a, 228, {&MODULE_P24, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_6_TOUT256_P13_7_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_b, 256, {&MODULE_P13, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_7N_TOUT115_P01_7_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_e, 115, {&MODULE_P01, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_7N_TOUT152_P02_15_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_e, 152, {&MODULE_P02,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_7N_TOUT157_P01_15_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_f, 157, {&MODULE_P01,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_7N_TOUT192_P30_2_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_e, 192, {&MODULE_P30, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_7N_TOUT224_P24_2_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_e, 224, {&MODULE_P24, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_7N_TOUT252_P13_14_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_f, 252, {&MODULE_P13,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_7_TOUT118_P02_11_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_b, 118, {&MODULE_P02,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_7_TOUT161_P01_13_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_b, 161, {&MODULE_P01,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_7_TOUT197_P30_7_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_a, 197, {&MODULE_P30, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_7_TOUT229_P24_7_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_a, 229, {&MODULE_P24, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_7_TOUT264_P13_15_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_h, 264, {&MODULE_P13,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_8_TOUT162_P01_8_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_b, 162, {&MODULE_P01, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_8_TOUT198_P30_8_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_a, 198, {&MODULE_P30, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_8_TOUT202_P30_12_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_e, 202, {&MODULE_P30,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_8_TOUT230_P24_8_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_a, 230, {&MODULE_P24, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_8_TOUT258_P14_11_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_b, 258, {&MODULE_P14,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_9_TOUT163_P01_10_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_b, 163, {&MODULE_P01,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_9_TOUT199_P30_9_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_a, 199, {&MODULE_P30, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_9_TOUT203_P30_13_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_e, 203, {&MODULE_P30,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_9_TOUT231_P24_9_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_a, 231, {&MODULE_P24, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM4_9_TOUT259_P14_14_OUT = {IfxGtm_Tom_4, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_b, 259, {&MODULE_P14,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_0_TOUT140_P32_5_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 140, {&MODULE_P32, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_0_TOUT174_P31_0_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_b, 174, {&MODULE_P31, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_0_TOUT190_P30_0_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_b, 190, {&MODULE_P30, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_0_TOUT206_P25_0_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_b, 206, {&MODULE_P25, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_0_TOUT222_P24_0_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_b, 222, {&MODULE_P24, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_0_TOUT242_P15_10_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_0, IfxGtm_ToutSel_e, 242, {&MODULE_P15,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_10_TOUT184_P31_10_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_10, IfxGtm_ToutSel_b, 184, {&MODULE_P31,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_10_TOUT188_P31_14_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_10, IfxGtm_ToutSel_f, 188, {&MODULE_P31,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_10_TOUT200_P30_10_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_10, IfxGtm_ToutSel_b, 200, {&MODULE_P30,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_10_TOUT204_P30_14_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_10, IfxGtm_ToutSel_f, 204, {&MODULE_P30,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_10_TOUT216_P25_10_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_10, IfxGtm_ToutSel_b, 216, {&MODULE_P25,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_10_TOUT220_P25_14_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_10, IfxGtm_ToutSel_f, 220, {&MODULE_P25,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_10_TOUT232_P24_10_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_10, IfxGtm_ToutSel_b, 232, {&MODULE_P24,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_11_TOUT185_P31_11_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_b, 185, {&MODULE_P31,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_11_TOUT189_P31_15_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_f, 189, {&MODULE_P31,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_11_TOUT201_P30_11_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_b, 201, {&MODULE_P30,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_11_TOUT205_P30_15_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_f, 205, {&MODULE_P30,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_11_TOUT217_P25_11_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_b, 217, {&MODULE_P25,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_11_TOUT221_P25_15_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_f, 221, {&MODULE_P25,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_11_TOUT233_P24_11_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_11, IfxGtm_ToutSel_b, 233, {&MODULE_P24,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_12_TOUT186_P31_12_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_b, 186, {&MODULE_P31,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_12_TOUT202_P30_12_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_b, 202, {&MODULE_P30,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_12_TOUT218_P25_12_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_b, 218, {&MODULE_P25,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_12_TOUT230_P24_8_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_f, 230, {&MODULE_P24, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_12_TOUT234_P24_12_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_12, IfxGtm_ToutSel_b, 234, {&MODULE_P24,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_13_TOUT187_P31_13_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_b, 187, {&MODULE_P31,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_13_TOUT203_P30_13_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_b, 203, {&MODULE_P30,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_13_TOUT219_P25_13_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_b, 219, {&MODULE_P25,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_13_TOUT231_P24_9_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_f, 231, {&MODULE_P24, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_13_TOUT235_P24_13_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_13, IfxGtm_ToutSel_b, 235, {&MODULE_P24,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_14_TOUT188_P31_14_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_b, 188, {&MODULE_P31,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_14_TOUT204_P30_14_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_b, 204, {&MODULE_P30,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_14_TOUT220_P25_14_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_b, 220, {&MODULE_P25,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_14_TOUT232_P24_10_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_f, 232, {&MODULE_P24,10}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_14_TOUT236_P24_14_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_14, IfxGtm_ToutSel_b, 236, {&MODULE_P24,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_15_TOUT189_P31_15_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_15, IfxGtm_ToutSel_b, 189, {&MODULE_P31,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_15_TOUT205_P30_15_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_15, IfxGtm_ToutSel_b, 205, {&MODULE_P30,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_15_TOUT221_P25_15_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_15, IfxGtm_ToutSel_b, 221, {&MODULE_P25,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_15_TOUT233_P24_11_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_15, IfxGtm_ToutSel_f, 233, {&MODULE_P24,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_15_TOUT237_P24_15_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_15, IfxGtm_ToutSel_b, 237, {&MODULE_P24,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_1_TOUT141_P32_6_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_e, 141, {&MODULE_P32, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_1_TOUT175_P31_1_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_b, 175, {&MODULE_P31, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_1_TOUT191_P30_1_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_b, 191, {&MODULE_P30, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_1_TOUT207_P25_1_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_b, 207, {&MODULE_P25, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_1_TOUT223_P24_1_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_b, 223, {&MODULE_P24, 1}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_1_TOUT243_P15_11_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_1, IfxGtm_ToutSel_e, 243, {&MODULE_P15,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_2_TOUT142_P32_7_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_e, 142, {&MODULE_P32, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_2_TOUT176_P31_2_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_b, 176, {&MODULE_P31, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_2_TOUT192_P30_2_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_b, 192, {&MODULE_P30, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_2_TOUT208_P25_2_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_b, 208, {&MODULE_P25, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_2_TOUT224_P24_2_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_b, 224, {&MODULE_P24, 2}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_2_TOUT244_P15_12_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_2, IfxGtm_ToutSel_e, 244, {&MODULE_P15,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_3_TOUT138_P23_6_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_e, 138, {&MODULE_P23, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_3_TOUT177_P31_3_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_b, 177, {&MODULE_P31, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_3_TOUT193_P30_3_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_b, 193, {&MODULE_P30, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_3_TOUT209_P25_3_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_b, 209, {&MODULE_P25, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_3_TOUT212_P25_6_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_j, 212, {&MODULE_P25, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_3_TOUT212_P26_0_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_j, 212, {&MODULE_P26, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_3_TOUT225_P24_3_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_b, 225, {&MODULE_P24, 3}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_3_TOUT258_P14_11_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_3, IfxGtm_ToutSel_e, 258, {&MODULE_P14,11}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_4_TOUT139_P23_7_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_e, 139, {&MODULE_P23, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_4_TOUT178_P31_4_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_b, 178, {&MODULE_P31, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_4_TOUT194_P30_4_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_b, 194, {&MODULE_P30, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_4_TOUT210_P25_4_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_b, 210, {&MODULE_P25, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_4_TOUT226_P24_4_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_b, 226, {&MODULE_P24, 4}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_4_TOUT261_P14_12_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_4, IfxGtm_ToutSel_e, 261, {&MODULE_P14,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_5_TOUT179_P31_5_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_b, 179, {&MODULE_P31, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_5_TOUT195_P30_5_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_b, 195, {&MODULE_P30, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_5_TOUT211_P25_5_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_b, 211, {&MODULE_P25, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_5_TOUT227_P24_5_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_b, 227, {&MODULE_P24, 5}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_5_TOUT260_P14_13_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_5, IfxGtm_ToutSel_e, 260, {&MODULE_P14,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_6_TOUT180_P31_6_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_b, 180, {&MODULE_P31, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_6_TOUT196_P30_6_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_b, 196, {&MODULE_P30, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_6_TOUT212_P25_6_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_b, 212, {&MODULE_P25, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_6_TOUT212_P26_0_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_b, 212, {&MODULE_P26, 0}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_6_TOUT228_P24_6_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_b, 228, {&MODULE_P24, 6}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_6_TOUT259_P14_14_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_6, IfxGtm_ToutSel_e, 259, {&MODULE_P14,14}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_7_TOUT181_P31_7_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_b, 181, {&MODULE_P31, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_7_TOUT197_P30_7_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_b, 197, {&MODULE_P30, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_7_TOUT213_P25_7_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_b, 213, {&MODULE_P25, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_7_TOUT229_P24_7_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_b, 229, {&MODULE_P24, 7}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_7_TOUT263_P14_15_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_7, IfxGtm_ToutSel_e, 263, {&MODULE_P14,15}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_8_TOUT182_P31_8_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_b, 182, {&MODULE_P31, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_8_TOUT186_P31_12_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_f, 186, {&MODULE_P31,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_8_TOUT198_P30_8_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_b, 198, {&MODULE_P30, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_8_TOUT202_P30_12_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_f, 202, {&MODULE_P30,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_8_TOUT214_P25_8_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_b, 214, {&MODULE_P25, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_8_TOUT218_P25_12_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_f, 218, {&MODULE_P25,12}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_8_TOUT230_P24_8_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_8, IfxGtm_ToutSel_b, 230, {&MODULE_P24, 8}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_9_TOUT183_P31_9_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_b, 183, {&MODULE_P31, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_9_TOUT187_P31_13_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_f, 187, {&MODULE_P31,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_9_TOUT199_P30_9_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_b, 199, {&MODULE_P30, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_9_TOUT203_P30_13_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_f, 203, {&MODULE_P30,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_9_TOUT215_P25_9_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_b, 215, {&MODULE_P25, 9}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_9_TOUT219_P25_13_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_f, 219, {&MODULE_P25,13}, IfxPort_OutputIdx_alt1};
IfxGtm_Tom_ToutMap IfxGtm_TOM5_9_TOUT231_P24_9_OUT = {IfxGtm_Tom_5, IfxGtm_Tom_Ch_9, IfxGtm_ToutSel_b, 231, {&MODULE_P24, 9}, IfxPort_OutputIdx_alt1};

